---
kind: type
id: T:Autodesk.Revit.DB.FloorType
source: html/b6fd8c08-7eea-1ab4-b7ab-096778b46e8f.htm
---
# Autodesk.Revit.DB.FloorType

An object that specifies the type of a floor in Autodesk Revit.

## Syntax (C#)
```csharp
public class FloorType : HostObjAttributes
```

## Remarks
The structural layers of the floor can be accessed via this object.